lab2_blog/app/views/posts/_form.html.erb

    <%= form.label :category_id, 'Category' %>
    <%= form.collection_select :category_id, Category.all, :id, :name, {}, class: 'form-control' %>
---
SELECT "categories".* FROM "categories"