lab2_blog/app/views/posts/index.html.erb

SELECT "categories".* FROM "categories"
---
      <%= form.label :category_id, "Category" %>
      <%= form.collection_select :category_id, Category.all, :id, :name, { include_blank: "All Categories" }, { class: "form-control" } %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
        <p class="mb-1"><strong>Category:</strong> <%= post.category&.name || 'Uncategorized' %></p>
        <p class="mb-0"><strong>Comments:</strong> <%= post.comments.count %></p>