lab2_blog/app/views/posts/show.html.erb

  <ul class="list-group list-group-flush">
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]