lab2_blog/app/controllers/posts_controller.rb

  def index
    @posts = filter_and_sort_posts(Post.all, filter_params)
---
SELECT "posts".* FROM "posts" WHERE (title ILIKE $1 OR body ILIKE $2)  [[nil, "%1234%"], [nil, "%1234%"]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Heyd"], ["body", nil], ["created_at", "2024-10-14 17:08:24.684680"], ["updated_at", "2024-10-14 17:08:24.684680"], ["category_id", 1]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = $1, "category_id" = $2 WHERE "posts"."id" = $3  [["updated_at", "2024-10-14 15:44:33.932437"], ["category_id", 1], ["id", 2]]