lab2_blog/app/controllers/profiles_controller.rb

  def update
    if params[:user][:two_factor_enabled] == "true"
      enable_2fa
    elsif params[:user][:two_factor_enabled] == "false"
      disable_2fa
    end

    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "two_factor_enabled" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-11-06 20:02:05.269495"], ["two_factor_enabled", true], ["id", 7]]

  def disable_2fa
    @user.update(otp_required_for_login: false, otp_secret: nil)
---
UPDATE "users" SET "updated_at" = $1, "otp_required_for_login" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-11-06 17:59:23.261960"], ["otp_required_for_login", "[FILTERED]"], ["id", 5]]