lab2_blog/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "failed_attempts" = $2, "locked_until" = $3 WHERE "users"."id" = $4  [["updated_at", "2024-11-06 19:33:05.126494"], ["failed_attempts", 0], ["locked_until", "2024-11-06 19:43:05.125997"], ["id", 7]]
---
  def create
    user = User.find_by(email: params[:user][:email])

    if user&.locked?
      redirect_to '/users/sign_in', alert: "Your account has been locked for 10 minutes due to multiple failed login attempts." and return
    end

    if user && !user.valid_password?(params[:user][:password])
      user.increment_failed_attempts!